precursor_kEpsilonCoarse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1800
(
(0.0786607 1.70886e-09 -2.6923e-10)
(0.0786601 -3.18765e-10 1.66978e-10)
(0.0786604 -1.36663e-09 6.81122e-11)
(0.104119 6.94869e-10 -3.66824e-10)
(0.104119 -1.19408e-09 9.24747e-11)
(0.104119 5.565e-10 2.75482e-10)
(0.119874 -1.57141e-09 -3.81895e-10)
(0.119873 -2.25036e-09 8.22143e-11)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
