precursor_kEpsilonCoarse/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
1800
(
0.00141526
0.00141531
0.00141523
0.00779541
0.00779566
0.00779542
0.00946186
0.00946207
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
120
(
0.00174461
0.000292548
0.000363111
0.000443725
0.000636445
0.00074772
0.000866865
0.000990934
...
)
;
    }
    noSlipWalls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
90
(
0.00174461
0.00812926
0.00973289
0.0109293
0.0119065
0.0127343
0.0134603
0.0141203
...
)
;
    }
}


// ************************************************************************* //
